[
  {
    "title":"Teachers and the Teaching Environment",
    "blurb": "Are skilled teachers working together with supportive administrators?",
    "text":"This category measures the relevant abilities of a school's teachers and the degree to which they are receiving the support they need to grow as professionals.  It considers factors like teacher professional qualifications, effective classroom practices, and school-wide support for teaching development and growth.",
    "sub":{
      "A":{
        "title":"Knowledge and Skills of Teachers",
        "blurb": "Do qualified teachers employ effective practices?",
        "text":"This subcategory seeks to determine the degree to which a school's teachers are prepared for their classroom assignments.  It includes measures of teacher qualifications and effective classroom practices.",
        "measures":{
          "i":{
            "title":"Professional Qualifications",
            "text":"This measure includes the percentage of teachers working in their area of licensure, and draws on anonymous teacher reports on their own comfort teaching grade-level, topics, and student body.",
            "nonlikert":[
              {
                "title":"Percentage of Teachers Working in Area of Licensure",
                "benchmark":100,
                "benchmark_explanation":"Benchmark from panel of experts."
              }
            ]
          },
          "ii": {
            "title":"Effective Practices",
            "text":"This measure draws on anonymous student reports about factors like teacher clarity, support of students, and classroom management."
          }
        }
      },
      "B":{
        "title":"Teaching Environment",
        "blurb": "Are teachers supported in their development as professionals?",
        "text":"This subcategory seeks to determine how well a school supports teachers and enables them to do their work.  It includes measures of teacher satisfaction, effective leadership, and school-wide support for teacher development.",
        "measures":{
          "i":{
            "title":"Professional Community",
            "text":"This measure includes teacher reports on the professional community and includes the teacher retention rate.",
            "nonlikert":[
              {
                "title":"Teacher Retention Rate (%)",
                "benchmark":90,
                "benchmark_explanation":"Benchmark from panel of experts."
              }
            ]
          },
          "ii":{
            "title":"Support For Teaching Development And Growth",
            "text":"This measure includes district-wide professional development expenditures, and draws on anonymous teacher reports on the quality of professional development.",
            "nonlikert":[
              {
                "title":"Professional Development Spending per Teacher",
                "benchmark":2925.43,
                "benchmark_explanation":"State average."
               }
            ]
          },
          "iii":{
            "title":"Effective Leadership",
            "text":"This measure draws on anonymous teacher reports about the degree to which they trust their principals to make good school-wide decisions, as well as on the degree to which their principals are strong instructional leaders."
          }
        }
      }
    }
  }, {
    "title":"School Culture",
    "blurb": "Is there a safe and nurturing academic environment?",
    "text":"This category measures the degree to which the school environment is safe, caring, and academically-oriented.  It considers factors like bullying, student/teacher relationships, and student valuing of learning.",
    "sub":{
      "A":{
        "title":"Safety",
        "blurb": "Do students feel physically and emotionally safe at school?",
        "text":"This subcategory seeks to determine how safe the school environment is.  It includes measures of physical safety, bullying, and trust.",
        "measures":{
          "i":{
            "title":"Student Physical Safety",
            "text":"This measure draws on anonymous student reports about the degree to which they feel physically safe at school."
          },
          "ii":{
            "title":"Student Emotional Safety",
            "text":"This measure draws on anonymous student and teacher reports about the nature and frequency of school bullying and emotional harassment."
          }
        }
      },
      "B":{
        "title": "Relationships",
        "blurb": "Are students connected to the school and to their teachers?",
        "text":" This subcategory seeks to determine how welcoming and caring the school environment is. It includes measures of student sense of belonging and of student/teacher relationships.",
        "measures":{
          "i":{
            "title":"Sense of Belonging",
            "text":"This measure draws on anonymous student reports about the degree to which they feel understood, supported, and accepted by students and adults at the school."
          },
          "ii":{
            "title":"Student/Teacher Relationships",
            "text":"This measure draws on anonymous student reports about the degree to which they feel respected and cared for by their teachers."
          }
        }
      },
      "C":{
        "title":"Academic Challenge",
        "blurb": "Do students consistently come to school ready to learn?",
        "text":"This subcategory seeks to determine the degree to which a school encourages students to focus on meeting academic challenges. It includes measures of student attendance and graduation, as well as of academic emphasis.",
        "measures":{
          "i":{
            "title": "Valuing of Learning",
            "text": "This measure includes attendance rates and also draws on anonymous student reports about how important school is to them and how much they view themselves as learners.",
            "nonlikert":[
              {
                "title":"Percentage of Students Chronically Absent",
                "benchmark":10,
                "benchmark_explanation":"National average."
	            },{
                "title":"Average Attendance Rate (%)",
                "benchmark":94.9,
                "benchmark_explanation":"State average."
              }
            ]
          },
          "ii":{
            "title":"Academic Challenge",
            "text":"This measure draws on anonymous student reports about the degree to which teachers push them to do their best, work hard, and understand the material."
          }
        }
      }
    }
  }, {
    "title": "Resources",
    "blurb": "Are facilities and personnel adequate to support learning?",
    "text": "This category measures the adequacy of a school's facility, personnel, and curriculum, as well as the degree to which it is supported by the community.  It considers factors like physical spaces and materials, class size, and family/school relationships.",
    "sub": {
      "A": {
        "title": "Facilities and Personnel",
        "blurb": "Are physical spaces and support staff sufficient to support learning?",
        "text": "This subcategory seeks to determine the sufficiency of a school's staffing and facilities.  It measures the quality of physical spaces and curricular materials, as well as the availability of content specialists and support personnel.",
        "measures": {
          "i": {
            "title": "Physical Spaces and Materials",
            "text": "This measure draws on anonymous teacher reports about their access to high-quality materials and facilities as well as administrative data on class size.",
            "nonlikert": [{
                "title": "Average Class Size (#)",
                "benchmark": 18.1,
                "benchmark_explanation": "State average"
            }]
          },
          "ii": {
            "title": "Content Specialists and Support Staff",
            "text": "This measure includes student-to-art-teacher, student-to-counselor, and student-to-specialist ratios, and draws on anonymous student and teacher reports about the degree to which content specialists and support staff are available and effective.",
            "nonlikert": [
              {
                "title": "Counselors per Student",
                "benchmark": 0.004,
                "benchmark_explanation": "Benchmark from panel of experts"
              },
              {
                "title": "Instructional Support Staff (Reading Coaches, etc.) per Student",
                "benchmark": 0.012,
                "benchmark_explanation": "National average"
              }
            ]
          }
        }
      },
      "B": {
        "title": "Learning Resources",
        "blurb": "Does the school have a strong and varied curriculum?",
        "text": "This subcategory seeks to determine the degree to which a school's classrooms include the essential resources teachers need.  It includes measures of curriculum strength, curriculum variety, and cultural responsiveness.",
        "measures": {
          "i": {
            "title": "Curricular Strength and Variety",
            "text": "This measure includes the percentage of students completing the state core curriculum, the number of different classes offered per student, and the percentage of students participating in Advanced Placement courses in high school.  It also draws on anonymous teacher reports on the strength and variety of the school curriculum.",
            "nonlikert": [
              {
                "title": "Percent of Students Completing MassCore Curriculum (HS only)",
                "benchmark": 72.4,
                "benchmark_explanation": "State average"
              }, {
                "title": "Percent of Students Taking AP Tests (HS only)",
                "benchmark": 16,
                "benchmark_explanation": "State average"
              }, {
                "title": "Percent of AP Test Takers Earning Scores of 3 or Above (HS only)",
                "benchmark": 63.1,
                "benchmark_explanation": "State average"
              }
            ]
          },
          "ii": {
            "title": "Cultural Responsiveness",
            "text": "This measure draws on anonymous teacher reports on the degree to which the curriculum adequately represents diverse cultures and perspectives and the degree to which they are adequately supported and prepared to teach in a culturally responsive manner."
          },
          "iii": {
            "title": "Co-Curricular Resources",
            "text": "This measure will include administrative data on the number and variety of extra- and co-curricular activities offered (e.g., sports teams and clubs)."
          }
        }
      },
      "C": {
        "title": "Community Support",
        "blurb": "Does the school have strong ties with families and the community?",
        "text": "This subcategory seeks to determine the degree to which schools are supported by the surrounding community.  It includes measures of family/school relationships, community involvement, and external partnerships.",
        "measures": {
          "i": {
            "title": "Family/School Relationships",
            "text": "This measure draws on anonymous teacher reports about parental engagement, as well as anonymous student reports about the degree to which their parents support them as learners."
          },
          "ii": {
            "title": "Community Involvement and External Partners",
            "text": "This measure draws on anonymous teacher reports about the degree to which the school is an integrated part of the community."
          }
        }
      }
    }
  }, {
    "title": "Indicators of Academic Learning",
    "blurb": "Are students developing academic dispositions and content knowledge?",
    "text": "This category measures how much students are learning core academic content, developing their own academic identities, and progressing along positive trajectories.  It considers factors like academic performance, engagement in school, problem solving, and college-going rates.",
    "sub": {
      "A": {
        "title": "Performance",
        "blurb": "Are students developing their literacy and numeracy skills?",
        "text": "This subcategory seeks to determine the degree to which students are learning core curricular content.  It includes measures of growth on standardized tests and teacher perceptions of student academic growth; in the future, it will also include portfolio assessment scores.",
        "measures": {
          "i": {
            "title": "Performance Growth",
            "text": "This measure includes school-wide scores for student growth on standardized tests, calculated by considering prior testing history and other factors. As new measures become available, this measure will change to better reflect student learning.",
            "nonlikert": [{
                "title": "SGP Growth Score on English MCAS",
                "benchmark": 50,
                "benchmark_explanation": "State average"
              }, {
                "title": "SGP Growth Score on Math MCAS",
                "benchmark": 50,
                "benchmark_explanation": "State average"
              }
            ]
          },
          "ii": {
            "title": "Overall performance",
            "text": "This measure draws on anonymous teacher reports about the efforts and abilities of their students. In the future this measure will also include the results of teacher-designed curriculum-embedded performance assessments."
          }
        }
      },
      "B": {
        "title": "Student Commitment to Learning",
        "blurb": "Do students engage in class and value the process of learning?",
        "text": "This subcategory seeks to determine the degree to which students are invested in the process of learning.  It includes measures of student engagement and of how much students value learning.",
        "measures": {
          "i": {
            "title": "Engagement in School",
            "text": "This measure draws on anonymous student reports about their level of focus, participation, and interest in class."
          },
          "ii": {
            "title": "Degree completion",
            "text": "This measure includes ",
            "nonlikert": [{
                "title":"4-Year Graduation Rate (HS only)",
                "benchmark":86.1,
                "benchmark_explanation":"State average."
              },{
                "title":"5-Year Graduation Rate (HS only)",
                "benchmark":87.7,
                "benchmark_explanation":"State average"
              },{
                "title":"English Language Learner 4-Year Graduation Rate (HS only)",
                "benchmark":63.9,"benchmark_explanation":
                "State average"
              },{
                "title":" English Language Learner 5-Year Graduation Rate (HS only)",
                "benchmark":70.9,
                "benchmark_explanation":"State average"
              },{
                "title":"Special Education 4-Year Graduation Rate (HS only)",
                "benchmark":69.1,
                "benchmark_explanation":"State average"
              },{
                "title":"Special Education 5-Year Graduation Rate (HS only)",
                "benchmark":72.9,
                "benchmark_explanation":"State average"
              }
            ]
          }
        }
      },
      "C": {
        "title": "Critical Thinking",
        "blurb": "Does the school emphasize the development of problem solving skills?",
        "text": "This subcategory seeks to determine whether students are learning to think critically about school subjects and the world around them.  It includes measures of how much problem solving is emphasized in class and, in the future, will include a measure of student problem solving ability.",
        "measures": {
          "i": {
            "title": "Problem Solving Emphasis",
            "text": "This measure draws on anonymous teacher reports about how often their students have the opportunity to generative their own interpretations of material and apply knowledge to new situations."
          },
          "ii": {
            "title": "Problem Solving Skills",
            "text": "In the future, this measure will include an assessment of student ability to address problems without obvious solutions."
          }
        }
      },
      "D": {
        "title": "College and Career Readiness",
        "blurb": "Are students being prepared for college and/or the workforce?",
        "text": "This subcategory, applicable to high schools only, seeks to determine the degree to which students are prepared for college and beyond.  It measures the percentage of students directly enrolling in two- or four-year colleges upon high school graduation and, in the future, will measure the college and career performance of high school graduates.",
        "measures": {
          "i": {
            "title": "College-Going and Persistence",
            "text": "This measure includes the percentage of students enrolling in college immediately after high school graduation and, in the future, will include the college grades and employment status of graduates.",
            "nonlikert": [
              {
                "title": "Percentage of Students Enrolling in College (HS only)",
                "benchmark": 75,
                "benchmark_explanation": "Benchmark from a panel of experts"
              }
            ]
          },
          "ii": {
            "title": "Career Preparation and Placement",
            "text": "In the future, this measure will include data on career technical education offerings and positive career placement as well as student anonymous reports on the extent to which they feel adequately prepared for the career of their choice."
          }
        }
      }
    }
  },
  {
    "title": "Character and Wellbeing Outcomes",
    "blurb": "Are students healthy and well-rounded?",
    "text": "This category measures the development of traits relevant for full and rewarding lives-in society, the workplace, and their private lives.  It considers factors like perseverance and determination, participation in arts and literature, and social and emotional health.",
    "sub": {
      "A": {
        "title": "Civic Engagement",
        "blurb": "Do students understand and appreciate each other’s differences?",
        "text": "This subcategory seeks to determine the degree to which students are prepared to thoughtfully meaningfully interact with others in a diverse society.  It measures how well students understand the perspectives of others, as well as the degree to which they get along with those unlike themselves.",
        "measures": {
          "i": {
            "title": "Appreciation for Diversity",
            "text": "This measure draws on anonymous student reports about their level of comfort working with students from a wide variety of backgrounds."
          },
          "ii": {
            "title": "Civic Participation",
            "text": "This measure draws on anonymous student reports about the extent to which they believe they have a responsibility to be informed about current issues and be involved in efforts to improve their communities."
          }
        }
      },
      "B": {
        "title": "Work Ethic",
        "text": "This subcategory seeks to determine the degree to which students are willing to work hard on challenging tasks, even in light of setbacks.  It includes measures of perseverance, determination, and orientation toward personal growth.",
        "measures": {
          "i": {
            "title": "Perseverance and Determination",
            "text": "This measure draws on anonymous student reports about their ability to pursue goals, work hard in spite of challenges, and finish what they start."
          },
          "ii": {
            "title": "Growth Mindset",
            "text": "This measure draws on anonymous student reports about the degree to which they see themselves as capable of expanding their skills through hard work."
          }
        }
      },
      "C": {
        "title": "Artistic and Creative Traits",
        "blurb": "Are students exposed to arts, literature, and creative activities?",
        "text": "This subcategory seeks to determine the degree to which students are being nurtured as artistic and creative people.  It includes measures of student participation in arts.",
        "measures": {
          "i": {
            "title": "Participation in Creative and Performing Arts",
            "text": "This measure draws on anonymous teacher and student reports about the frequency of student exposure to the arts.",
            "nonlikert": [{
              "title": "Ratio of Art Classes to Total Students",
              "benchmark": 0.082,
              "benchmark_explanation": "State average"
            },{
              "title": "Art Instruction Hours Per Student Per Week",
              "benchmark": 1
            }]
          },
          "ii": {
            "title": "Valuing Creative and Performing Arts",
            "text": "This measure includes anonymous student reports about their interest in participating in or attending a range of creative or performing arts."
          }
        }
      },
      "D": {
        "title": "Health",
        "blurb": "Are students socially, emotionally, and physically healthy?",
        "text": "This subcategory seeks to determine the health of students and the degree to which the school supports various health outcomes.  It includes measures of student social, emotional, and physical health.",
        "measures": {
          "i": {
            "title": "Social and Emotional Health",
            "text": "This measure draws on anonymous student reports about how happy, calm, and focused they feel in school. In the future, this measure will include anonymous student reports about academic stress."
          },
          "ii": {
            "title": "Physical Health",
            "text": "This measure draws on anonymous teacher reports about student access to physical education and activity.",
            "nonlikert": [{
                "title": "Ratio of PE Classes to Total Students",
                "benchmark": 0.06,
                "benchmark_explanation": "State average"
              },{
              }
            ]
          }
        }
      }
    }
  }
]
